RoelandK/GRBL_LM4F120H5QR/stepper.c
#ifdef STEP_PULSE_DELAY
  // This interrupt is used only when STEP_PULSE_DELAY is enabled. Here, the step pulse is
  // initiated after the STEP_PULSE_DELAY time period has elapsed. The ISR TIMER2_OVF interrupt
  // will then trigger after the appropriate settings.pulse_microseconds, as in normal operation.
  // The new timing between direction, step pulse, and step complete events are setup in the
  // st_wake_up() routine.
///ISR(TIMER2_COMPA_vect)
void timer2_compare_interrupt ( void )
{
///  STEPPING_PORT = step_bits; // Begin step pulse.  <-- BAD CODE. Forgot about other pins on this port?
  GPIOPinWrite( STEPPING_PORT, STEP_MASK, step_bits );
}
#endif

// Reset and clear stepper subsystem variables
void st_reset()
{
  memset(&st, 0, sizeof(st));
  set_step_events_per_minute(MINIMUM_STEPS_PER_MINUTE);
  current_block = NULL;
  busy = false;
}

// Initialize and start the stepper motor subsystem
void st_init()
{
  // Configure directions of interface pins
///  STEPPING_DDR |= STEPPING_MASK;
  SysCtlPeripheralEnable( STEPPING_SYSCTL_PERIPH );
  SysCtlDelay(26); ///give time delay 1 microsecond for GPIO module to start
  GPIOPinTypeGPIOOutput( STEPPING_PORT, STEPPING_MASK );
///  STEPPING_PORT = (STEPPING_PORT & ~STEPPING_MASK) | settings.invert_mask;
  GPIOPinWrite( STEPPING_PORT, STEPPING_MASK, settings.invert_mask );
///  STEPPERS_DISABLE_DDR |= 1<<STEPPERS_DISABLE_BIT;
  SysCtlPeripheralEnable( STEPPERS_DISABLE_SYSCTL_PERIPH );
  GPIOPinTypeGPIOOutput( STEPPERS_DISABLE_PORT, (1<<STEPPERS_DISABLE_BIT) );

/*
  // waveform generation = 0100 = CTC
  /// Timer1 (16 bit) mode:
  /// CTC - Clear Timer on Compare
  /// Maximum reachable value = OCR1A
  /// TOV1 flag is set (interrupt occurs) on max value (OCR1A)
  /// Timer1 gives interrupt frequency = F_CPU/(prescaler*(1+OCR1A))

  TCCR1B &= ~(1<<WGM13);
  TCCR1B |=  (1<<WGM12);
  TCCR1A &= ~(1<<WGM11);
  TCCR1A &= ~(1<<WGM10);

  // output mode = 00 (disconnected)
  TCCR1A &= ~(3<<COM1A0);
  TCCR1A &= ~(3<<COM1B0);

  // Configure Timer 2 (8 bit)
  /// Maximum reachable value = 0xFF
  /// OCRx is updated immediately
  /// TOV flag is set (interrupt occurs) on max value (0xFF)
  /// Timer2 gives interrupt frequency F_CPU/(prescaler*256)
  TCCR2A = 0; // Normal operation
  TCCR2B = 0; // Disable timer until needed (switch to 'no clock source')
  TIMSK2 |= (1<<TOIE2); // Enable Timer2 Overflow interrupt
  #ifdef STEP_PULSE_DELAY
    TIMSK2 |= (1<<OCIE2A); // Enable Timer2 Compare Match A interrupt
  #endif
*/
  // Configure Timer1
  SysCtlPeripheralEnable( SYSCTL_PERIPH_TIMER1 );
  SysCtlDelay(26); ///give time delay 1 microsecond for timer1 module to start
  TimerConfigure( TIMER1_BASE, TIMER_CFG_PERIODIC_UP );
  IntPrioritySet( INT_TIMER1A, 32 ); //lower priority than for Timer2 (which resets the step-dir signal)
  TimerControlStall( TIMER1_BASE, TIMER_A, true ); //timer1 will stall in debug mode
  TimerIntRegister( TIMER1_BASE, TIMER_A, timer1_compare_interrupt );
  TimerIntClear( TIMER1_BASE, 0xFFFF ); //disable timer1 immediate interrupt (bug of ARM?)
  IntPendClear( INT_TIMER1A );
  TimerIntEnable( TIMER1_BASE, TIMER_TIMA_TIMEOUT );

  // Configure Timer2
  SysCtlPeripheralEnable( SYSCTL_PERIPH_TIMER2 );
  SysCtlDelay(26); // give time delay 1 microsecond for timer2 module to start
  TimerConfigure( TIMER2_BASE, TIMER_CFG_SPLIT_PAIR | TIMER_CFG_A_ONE_SHOT_UP );
  IntPrioritySet( INT_TIMER2A, 0 ); // highest priority - higher than for Timer1 (which sets the step-dir output)
  TimerControlStall( TIMER2_BASE, TIMER_A, true ); //timer2 will stall in debug mode
  TimerIntRegister( TIMER2_BASE, TIMER_A, timer2_overflow_interrupt );
  TimerIntClear( TIMER2_BASE, 0xFFFF ); // disable timer2 immediate interrupt (bug of ARM?)
  IntPendClear( INT_TIMER2A );
  TimerIntEnable( TIMER2_BASE, TIMER_TIMA_TIMEOUT );

  // Start in the idle state, but first wake up to check for keep steppers enabled option.
  st_wake_up();
  st_go_idle();
}

// Configures the prescaler and ceiling of timer 1 to produce the given rate as accurately as possible.
// Returns the actual number of cycles per interrupt
static uint32_t config_step_timer(uint32_t cycles)
{
  TimerLoadSet( TIMER1_BASE, TIMER_A, cycles );
  return cycles;
/*  uint16_t ceiling;
  ///uint8_t prescaler;
  uint32_t actual_cycles;
  if (cycles <= 0xffffL) {
    ///timer1 interrupt frequency = 16'000'000/(1+cycles) = 16 MHz ... 244 Hz
    ceiling = cycles;
    ///prescaler = 1; // prescaler: 0
    actual_cycles = ceiling;
    TimerPrescaleSet( TIMER1_BASE, TIMER_A, 1 * 5 ); //prescaler is x5 because ARM is 5x faster (80 MHz)
    TimerLoadSet( TIMER1_BASE, TIMER_A, ceiling );
  } else if (cycles <= 0x7ffffL) { /// <= 524287
    ///timer1 interrupt frequency = 2'000'000/(1+cycles/8) = 244 Hz ... 30,517 Hz
    ceiling = cycles >> 3;
    ///prescaler = 2; // prescaler: 8
    actual_cycles = ceiling * 8L;
    TimerPrescaleSet( TIMER1_BASE, TIMER_A, 8 * 5 );
    TimerLoadSet( TIMER1_BASE, TIMER_A, ceiling );
  } else if (cycles <= 0x3fffffL) { /// <= 4194303
    ///timer1 interrupt frequency = 250'000/(1+cycles/64) = 3,8146 Hz ... 30,514 Hz
    ceiling =  cycles >> 6;
    ///prescaler = 3; // prescaler: 64
    actual_cycles = ceiling * 64L;
    TimerPrescaleSet( TIMER1_BASE, TIMER_A, 64 * 5 );
    TimerLoadSet( TIMER1_BASE, TIMER_A, ceiling );
  } else if (cycles <= 0xffffffL) { /// <= 16777215
    ///timer1 interrupt frequency = 62'500/(1+cycles/256) = 0,95365 Hz ... 3,8145 Hz
    ceiling =  (cycles >> 8);
    ///prescaler = 4; // prescaler: 256
    actual_cycles = ceiling * 256L;
    TimerPrescaleSet( TIMER1_BASE, TIMER_A, 256 * 5 );
    TimerLoadSet( TIMER1_BASE, TIMER_A, ceiling );
  } else if (cycles <= 0x3ffffffL) { /// <= 67108863
    ///timer1 interrupt frequency = 15'625/(1+cycles/1024) =  0,238415 Hz ... 0,95362 Hz
    ceiling = (cycles >> 10);
    ///prescaler = 5; // prescaler: 1024
    actual_cycles = ceiling * 1024L;
    TimerPrescaleSet( TIMER1_BASE, TIMER_A, 1024 * 5 );
    TimerLoadSet( TIMER1_BASE, TIMER_A, ceiling );
  } else {
    // Okay, that was slower than we actually go. Just set the slowest speed
    ///timer1 interrupt frequency = 15'625/(1+65535) = 0,238 Hz     (each 4,194304 sec)
    ///ceiling = 0xffff;
    ///prescaler = 5;
    TimerPrescaleSet( TIMER1_BASE, TIMER_A, 1024 * 5 );
    TimerLoadSet( TIMER1_BASE, TIMER_A, 0xFFFF );
    actual_cycles = 0xffff * 1024;
  }
  // Set prescaler
  ///TCCR1B = (TCCR1B & ~(0x07<<CS10)) | (prescaler<<CS10);
  // Set ceiling
  ///OCR1A = ceiling;
  return(actual_cycles);
  */
}

static void set_step_events_per_minute(uint32_t steps_per_minute)
{
  if (steps_per_minute < MINIMUM_STEPS_PER_MINUTE) { steps_per_minute = MINIMUM_STEPS_PER_MINUTE; }
  ///st.cycles_per_step_event = config_step_timer((TICKS_PER_MICROSECOND*1000000*60)/steps_per_minute);
  st.cycles_per_step_event = config_step_timer((F_CPU/steps_per_minute)*60); ///avoid values more than 4 billion...
}

